Revit 2024 API
SymbolTypeId.Bar Property
 Symbol bar, indicating unit Bars.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId Bar { get; }
Visual Basic
Public Shared ReadOnly Property Bar As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Bar {
	ForgeTypeId^ get ();
}
See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace